### Pandas

In [1]:
# it provides functions and methods to efficiently manipulate large datasets.
# data-structure in pandas:series-1 dimensional array,dataframe-2 dimensional array.

### Pandas series

In [2]:
# 1 dimensional array with labels.it can contains data type including integers,strings,floats,python objects and more.

### Pandas DataFrame

In [ ]:
# 2 dimensional array datastructure with labels,we can use labels to locate data.
# columns index(df.columns),rows index(df.index)

In [6]:
import pandas as pd

In [4]:
# check pandas version
print(pd.__version__)

1.3.4

### Series create,manipulate,querry,delete

In [5]:
# creating series from a list
arr=[0,1,2,3,4]
s1=pd.Series(arr)
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [6]:
order=[1,2,3,4,5]
s2=pd.Series(arr,index=order)
s2

1    0
2    1
3    2
4    3
5    4
dtype: int64

In [53]:
import numpy as np
n=np.random.randn(5)   # create a random Ndarray
index=['a','b','c','d','e']
s2=pd.Series(n,index=index)
s2

a   -0.768091
b   -1.782135
c   -0.186977
d   -0.567377
e   -0.641361
dtype: float64

In [9]:
# create series from dictionary
d={'a':1,'b':2,'c':3,'d':4,'e':5}
s3=pd.Series(d)
s3

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [11]:
# modify the index of series
print(s1)
s1.index=['A','B','C','D','E']
s1

0    0
1    1
2    2
3    3
4    4
dtype: int64

A    0
B    1
C    2
D    3
E    4
dtype: int64

In [13]:
#slicing
s1[:3]

A    0
B    1
C    2
dtype: int64

In [14]:
s4=s1.append(s3)
s4

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
s4.drop('e')

A    0
B    1
C    2
D    3
E    4
a    1
b    2
c    3
d    4
dtype: int64

### Series Operations

In [16]:
arr1=[0,1,2,3,4,5,7]
arr2=[6,7,8,9,5]

In [17]:
s5=pd.Series(arr2)
s5

0    6
1    7
2    8
3    9
4    5
dtype: int64

In [18]:
s6=pd.Series(arr1)
s6

0    0
1    1
2    2
3    3
4    4
5    5
6    7
dtype: int64

In [19]:
s5.add(s6)

0     6.0
1     8.0
2    10.0
3    12.0
4     9.0
5     NaN
6     NaN
dtype: float64

In [20]:
s5.sub(s6)

0    6.0
1    6.0
2    6.0
3    6.0
4    1.0
5    NaN
6    NaN
dtype: float64

In [21]:
s5.mul(s6)

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [22]:
s5.div(s6)

0     inf
1    7.00
2    4.00
3    3.00
4    1.25
5     NaN
6     NaN
dtype: float64

In [24]:
s7=s5.mul(s6)
s7

0     0.0
1     7.0
2    16.0
3    27.0
4    20.0
5     NaN
6     NaN
dtype: float64

In [25]:
print('median',s7.median())
print('max',s7.max())
print('min',s7.min())

median 16.0
max 27.0
min 0.0

### Create DataFrame

In [7]:
dates=pd.date_range('today',periods=6)  # define time sequence as index
dates

DatetimeIndex(['2022-06-17 13:30:09.345599', '2022-06-18 13:30:09.345599',
               '2022-06-19 13:30:09.345599', '2022-06-20 13:30:09.345599',
               '2022-06-21 13:30:09.345599', '2022-06-22 13:30:09.345599'],
              dtype='datetime64[ns]', freq='D')

In [10]:
dates=pd.date_range('today',periods=6)
num_arr=np.random.randn(6,4)  # import numpy random array
num_arr

array([[-2.12319864,  2.19495151, -0.75055518,  0.80030784],
       [ 0.2999199 , -2.11454133,  0.33833702,  1.45463536],
       [ 0.30351614,  0.0384858 ,  0.89297569,  0.16688846],
       [ 0.0930142 ,  0.22215092,  0.3927149 , -0.49009928],
       [ 0.90219317, -0.33324693, -0.07430617,  0.60401762],
       [-1.34171407, -0.58457503, -0.77296285,  1.86419461]])

In [11]:
dates=pd.date_range('today',periods=6)
num_arr=np.random.randn(6,4)
columns=['A','B','C','D'] # use table as the column name
columns

['A', 'B', 'C', 'D']

In [13]:
dates=pd.date_range('today',periods=6)
num_arr=np.random.randn(6,4)
columns=['A','B','C','D']
df1=pd.DataFrame(num_arr,index=dates,columns=columns)
df1

                                   A         B         C         D
2022-06-17 13:31:06.608748  0.672319 -0.291443  0.868574  0.023346
2022-06-18 13:31:06.608748  1.495170 -0.295964 -1.516874 -1.472093
2022-06-19 13:31:06.608748  0.324715 -0.564199  1.231795 -1.072346
2022-06-20 13:31:06.608748 -0.226015  0.981139 -0.240690 -3.017605
2022-06-21 13:31:06.608748 -0.280783 -1.817789 -0.354049 -0.457541
2022-06-22 13:31:06.608748 -0.142623 -1.605197 -0.355845  0.223897

In [56]:
data={'animals':['cat','dog','tiger','lion','dog'],'age':[5,4.5,6,8,np.nan],'visits':[2,1,2,1,3],'priority':['yes','no','no','yes','no']}
labels=['a','b','c','d','e']
df2=pd.DataFrame(data,index=labels)
df2

  animals  age  visits priority
a     cat  5.0       2      yes
b     dog  4.5       1       no
c   tiger  6.0       2       no
d    lion  8.0       1      yes
e     dog  NaN       3       no

In [57]:
# see datatypes of array
df2.dtypes

animals      object
age         float64
visits        int64
priority     object
dtype: object

In [58]:
df2.head(2)

  animals  age  visits priority
a     cat  5.0       2      yes
b     dog  4.5       1       no

In [59]:
df2.tail(3)

  animals  age  visits priority
c   tiger  6.0       2       no
d    lion  8.0       1      yes
e     dog  NaN       3       no

In [60]:
print(df2.index)
df2.columns

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

Index(['animals', 'age', 'visits', 'priority'], dtype='object')

In [61]:
df2.values

array([['cat', 5.0, 2, 'yes'],
       ['dog', 4.5, 1, 'no'],
       ['tiger', 6.0, 2, 'no'],
       ['lion', 8.0, 1, 'yes'],
       ['dog', nan, 3, 'no']], dtype=object)

In [62]:
df2.describe()  #see statitical data of dataframe

            age   visits
count  4.000000  5.00000
mean   5.875000  1.80000
std    1.547848  0.83666
min    4.500000  1.00000
25%    4.875000  1.00000
50%    5.500000  2.00000
75%    6.500000  2.00000
max    8.000000  3.00000

In [63]:
df2.T   # transposing

            a    b      c     d    e
animals   cat  dog  tiger  lion  dog
age       5.0  4.5    6.0   8.0  NaN
visits      2    1      2     1    3
priority  yes   no     no   yes   no

In [64]:
df2.sort_values(by='age')

  animals  age  visits priority
b     dog  4.5       1       no
a     cat  5.0       2      yes
c   tiger  6.0       2       no
d    lion  8.0       1      yes
e     dog  NaN       3       no

In [65]:
#slicing dataframe
df2.sort_values(by='age')[1:3]

  animals  age  visits priority
a     cat  5.0       2      yes
c   tiger  6.0       2       no

In [66]:
#query dataframe by tag
df2[['age','visits']]

   age  visits
a  5.0       2
b  4.5       1
c  6.0       2
d  8.0       1
e  NaN       3

In [67]:
df2.iloc[1:3] #query rows2,3   #iloc is inteerylocation

  animals  age  visits priority
b     dog  4.5       1       no
c   tiger  6.0       2       no

In [68]:
df3=df2.copy()
df3

  animals  age  visits priority
a     cat  5.0       2      yes
b     dog  4.5       1       no
c   tiger  6.0       2       no
d    lion  8.0       1      yes
e     dog  NaN       3       no

In [69]:
df3.isnull()

   animals    age  visits  priority
a    False  False   False     False
b    False  False   False     False
c    False  False   False     False
d    False  False   False     False
e    False   True   False     False

In [70]:
df3.loc['c','age']=1.5
df3

  animals  age  visits priority
a     cat  5.0       2      yes
b     dog  4.5       1       no
c   tiger  1.5       2       no
d    lion  8.0       1      yes
e     dog  NaN       3       no

In [71]:
df3[['age']].mean()

age    4.75
dtype: float64

In [75]:
df3.mean()

C:\Users\Soumya\AppData\Local\Temp/ipykernel_5964/3891983329.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  df3.mean()

age       4.75
visits    1.80
dtype: float64

In [82]:
df3['visits'].sum()

9

In [80]:
df3['visits'].min()

1

In [81]:
df3['visits'].max()

3

In [84]:
df3.sum()

animals     catdogtigerliondog
age                       19.0
visits                       9
priority          yesnonoyesno
dtype: object

In [86]:
string=pd.Series(['A','B','C','Aa','Bd',np.nan])
string

0      A
1      B
2      C
3     Aa
4     Bd
5    NaN
dtype: object

In [87]:
string=pd.Series(['A','B','C','Aa','Bd',np.nan])
string.str.lower()

0      a
1      b
2      c
3     aa
4     bd
5    NaN
dtype: object

In [88]:
string=pd.Series(['A','B','C','Aa','Bd',np.nan])
string.str.upper()

0      A
1      B
2      C
3     AA
4     BD
5    NaN
dtype: object

### Operations for dataframe missing values

In [89]:
df4=df3.copy()
df4

  animals  age  visits priority
a     cat  5.0       2      yes
b     dog  4.5       1       no
c   tiger  1.5       2       no
d    lion  8.0       1      yes
e     dog  NaN       3       no

In [90]:
df4=df3.copy()
df4.fillna(4)

  animals  age  visits priority
a     cat  5.0       2      yes
b     dog  4.5       1       no
c   tiger  1.5       2       no
d    lion  8.0       1      yes
e     dog  4.0       3       no

In [91]:
df4=df3.copy()
meanAge=df4['age'].mean()
df4['age'].fillna(meanAge)

a    5.00
b    4.50
c    1.50
d    8.00
e    4.75
Name: age, dtype: float64

In [92]:
df5=df3.copy()
df5

  animals  age  visits priority
a     cat  5.0       2      yes
b     dog  4.5       1       no
c   tiger  1.5       2       no
d    lion  8.0       1      yes
e     dog  NaN       3       no

In [93]:
df5=df3.copy()
df5.dropna(how='any')

  animals  age  visits priority
a     cat  5.0       2      yes
b     dog  4.5       1       no
c   tiger  1.5       2       no
d    lion  8.0       1      yes

### Dataframe file operations

In [104]:
df3.to_csv('animal.csv')

In [105]:
df_animal=pd.read_csv('animal.csv')
df_animal.head(3)

  Unnamed: 0 animals  age  visits priority
0          a     cat  5.0       2      yes
1          b     dog  4.5       1       no
2          c   tiger  1.5       2       no

In [106]:
df3.to_excel('animal.xlsx',sheet_name='Sheet1')

In [107]:
df_animal2=pd.read_excel('animal.xlsx','Sheet1',index_col=None,na_values=['NA'])
df_animal2

  Unnamed: 0 animals  age  visits priority
0          a     cat  5.0       2      yes
1          b     dog  4.5       1       no
2          c   tiger  1.5       2       no
3          d    lion  8.0       1      yes
4          e     dog  NaN       3       no